#+title:  Project Scratch
# When underneath a checklist item:
# M-RET: insert new dotpoint
# s-M-RET: insert todo item

* Feeders:
- [X] Implement a method in the feeder(s) for specific observation ratios.
  - [X] Implement method for overriding arg.feeder_args['obs_ratio'] in main or within configs...

* Train stgcn
- [-] ntu
- [-] ntu120
- [-] ucf101


* Configs
- [X] add `training_function` and `testing_function` to all configs...
- [ ] Change data_path to ...data_path..._mean.npz

* General
- [X] Implement normalisation in ntu feeder
  - The generation for mean_maps is in `data_gen/utils/get_mean_map.py`
- [X] Determine cause of accuracy drops MS-G3D
- [-] fix ntu120 CSet
  - It seems to be the dataset
    - Retraining *infogcn2 ntu120 CSet*

* Data generation
- [ ] Move mean and standard deviation map calculations to the data_gen
- [ ] Must re-perform std/mean map calculations
  - They are skewed by the auto-padding since they are calculated from the output of the feeder (which ALWAYS uses auto-padding)

* Image export
Cropping bounds: (250,150) -> (1150, 1050)
                # (x1, y1) -> (x2, y2)
Images 30-38


* Python testing...
#+begin_src emacs-lisp
(setq org-babel-python-command "/fred/oz141/ldezoete/environment/bin/python3")
#+end_src

#+RESULTS:
: /fred/oz141/ldezoete/environment/bin/python3

#+begin_src python :results output
import torch
import os.path as osp

model = "infogcn2"
dataset = "ucf101"
evaluation = "1"
flow_embedding = "base"
modifier = ""

root_path = './results/'
checkpoint_path = osp.join(root_path, model, dataset, evaluation, "train", f"{model}_{dataset}_{evaluation}_{flow_embedding}{modifier}.pt")

checkpoint = torch.load(checkpoint_path, map_location="cpu")
results = checkpoint['results']
print(f"Checkpoint keys: {checkpoint.keys()}")
print(f"Epoch (checkpoint): {checkpoint['epoch']}")
print(f"Result keys: {results.keys()}")
print(f"Train ACC: {results['train_ACC'][-1]}")
# print(f"Test ACC: {results['test_ACC']}")
#+end_src

#+RESULTS:
: Checkpoint keys: dict_keys(['epoch', 'model_state_dict', 'optimiser_state_dict', 'scheduler_state_dict', 'results'])
: Epoch (checkpoint): 70
: Result keys: dict_keys(['epoch', 'train_time', 'train_loss', 'lr', 'test_time', 'test_loss', 'train_ACC', 'test_ACC', 'train_AUC', 'test_AUC', 'train_cls_loss', 'test_cls_loss', 'train_feature_loss', 'test_feature_loss', 'train_recon_loss', 'test_recon_loss'])
: Train ACC: 70

#+begin_src python :results output
import torch
import mmnpz

# NTU60
CS_flow = "/fred/oz141/ldezoete/MS-G3D/data/ntu/aligned_data/ntu_CS-flowpose_D3_aligned_mean.npz"
CS_pose = "/fred/oz141/ldezoete/MS-G3D/data/ntu/aligned_data/ntu_CS-pose_aligned_mean.npz"
CV_flow = "/fred/oz141/ldezoete/MS-G3D/data/ntu/aligned_data/ntu_CV-flowpose_D3_aligned_mean.npz"
CV_pose = "/fred/oz141/ldezoete/MS-G3D/data/ntu/aligned_data/ntu_CV-pose_aligned_mean.npz"

# NTU120
CSet_flow = "/fred/oz141/ldezoete/MS-G3D/data/ntu120/aligned_data/ntu120_CSet-flowpose_D3_aligned_mean.npz"
CSet_pose = "/fred/oz141/ldezoete/MS-G3D/data/ntu120/aligned_data/ntu120_CSet-pose_aligned_mean.npz"
CSub_flow = "/fred/oz141/ldezoete/MS-G3D/data/ntu120/aligned_data/ntu120_CSub-flowpose_D3_aligned_mean.npz"
CSub_pose = "/fred/oz141/ldezoete/MS-G3D/data/ntu120/aligned_data/ntu120_CSub-pose_aligned_mean.npz"

path_dict = {
    'CS flowpose': CS_flow, 'CS pose': CS_pose, 'CV flowpose': CV_flow, 'CV pose': CV_pose,
    'CSet flowpose': CSet_flow, 'CSet pose': CSet_pose, 'CSub flowpose': CSub_flow, 'CSub pose': CSub_pose,
}

error_dict = {}

for name, path in path_dict.items():
    try:
        dat = mmnpz.load(path)
        print(f"Mean map shape: {dat['mean_map'].shape}")
        print(f"Std map shape: {dat['std_map'].shape}")
        if "CSub-pose" in path:
            print(dat['mean_map'])
            print(dat['mean_map'])
    except Exception as e:
        error_dict[name] = e

print(error_dict)
#+end_src

#+RESULTS:
#+begin_example
Mean map shape: (53, 25)
Std map shape: (53, 1, 25, 1)
Mean map shape: (3, 25)
Std map shape: (3, 1, 25, 1)
Mean map shape: (53, 25)
Std map shape: (53, 1, 25, 1)
Mean map shape: (3, 25)
Std map shape: (3, 1, 25, 1)
Mean map shape: (3, 25)
Std map shape: (3, 1, 25, 1)
Mean map shape: (3, 25)
Std map shape: (3, 1, 25, 1)
[[nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
  nan nan nan nan nan nan nan]
 [nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
  nan nan nan nan nan nan nan]
 [nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
  nan nan nan nan nan nan nan]]
[[nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
  nan nan nan nan nan nan nan]
 [nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
  nan nan nan nan nan nan nan]
 [nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
  nan nan nan nan nan nan nan]]
{'CSet flowpose': FileNotFoundError(2, 'No such file or directory'), 'CSub flowpose': FileNotFoundError(2, 'No such file or directory')}
#+end_example
